[
  {
    "date": "2021-01-01T00:00",
    "id": 1,
    "calories": 1000,
    "title": "Spaghetti Bolognese",
    "isCooked": false,
    "content": "Cook the spaghetti. Cook the ground beef. Mix them together.",
    "isFavorite": false
  },
  {
    "date": "2021-01-01T00:00",
    "id": 2,
    "calories": 1200,
    "title": "Pasta Carbonara",
    "isCooked": false,
    "content": "Boil the pasta. Mix eggs, cheese, and bacon. Combine with pasta.",
    "isFavorite": false
  },
  {
    "date": "2021-01-01T00:00",
    "id": 3,
    "calories": 800,
    "title": "Caesar Salad",
    "isCooked": false,
    "content": "Chop lettuce. Add croutons, parmesan, and dressing. Toss well.",
    "isFavorite": true
  },
  {
    "date": "2023-12-04T00:56:01.116164",
    "id": 4,
    "calories": 0,
    "title": "Electric Bread - Sticky Buns",
    "isCooked": false,
    "content": "Remove dough from the machine after the dough or manual cycle is completed. Prepare sticky sauce by warming all the sauce ingredients, except the pecans, over medium heat until sugar dissolves. Pour into 13 X 9 pan. Sprinkle with broken nuts. Turn dough out onto floured surface (it will be sticky), and punch down. Roll dough to a 16 X 10 rectangle. Dot with soft butter and sprinkle with cinnamon. Roll jellyroll style and pinch seams together. Slice 1 1/2-inch thick pieces, place into pan on top of sticky sauce, and let double in size (about one hour). Bake at 375F for 20-25 minutes. Cool for no more than three minutes, then invert pan so sauce and nuts are on top of buns. Ingredients for regular pan - 3/4 cups water; 2 cups white bread flour; 1 1/2 tbs dry milk; 2 tbs sugar; 1/2 tsp salt; 2 tbs butter; 1 tsp fast rise yeast; OR 2 tsp active dry yeast. Sticky Sauce: 1/4 cup butter; 1/2 cup brown sugar; 1/4 cup corn syrup (light); 1/4 cup pecans (broken). Filling: 1/4 cup soft butter; 1/2 tsp cinnamon. Use an 8 X 8 pan and roll the dough 12 X 8 rectangle.",
    "isFavorite": false
  },
  {
    "date": "2023-12-04T01:42:24.147687",
    "id": 5,
    "calories": 0,
    "title": "Elegant and Easy Gourmet Gefilte Fish Pate",
    "isCooked": false,
    "content": "Grind fish fine. Saute onions in oil till soft but not brown. Put the fish, onions, eggs, water, matzah meal, salt, white pepper, and sugar in a electric mixer bowl and beat on medium speed for 15 minutes. Grate the carrots and mix well. Pour the mixture into a gerased 12 cup bundt pan. Smooth the top with a spatula and bake in a preheated 325 degree oven for 1 hour in a larger pan filled with 2 inches water. Cover with alum foil and continue baking for 1 hour or until the center is solid. Cool for 5 minutes and then invert onto a flat serving plate. Refrigerate for several hours or over night. Slice as you would a torte and serve as an appetizer, garnished with parsley and served with red horseradish.",
    "isFavorite": false
  },
  {
    "date": "2023-12-04T01:42:27.670815",
    "id": 6,
    "calories": 0,
    "title": "Electronic Gourmet's French Dressing",
    "isCooked": false,
    "content": "In a bowl mix vinegar, salt and pepper with a fork. Add oil and mix vigerously until well blended and slightly thickened. Variations: ========== Garlic French Dressing: Drop 1 peeled, bruised clove of garlic into dressing and let stand 2-3 days at room temperature. Remove garlic before using dressing. Sweet French Dressing: Prepare as directed. Then mix in 1/4 c each of orange juice and honey or super fine sugar. Use to dress fruit salads. Hints: ===== For a creamier dressing, beat over ice for 1 to 2 minutes.",
    "isFavorite": false
  },
  {
    "date": "2023-12-04T01:47:13.474758",
    "id": 7,
    "calories": 444,
    "title": "Electronic Gourmet's French Dressing",
    "isCooked": false,
    "content": "In a bowl mix vinegar, salt and pepper with a fork. Add oil and mix vigerously until well blended and slightly thickened. Variations: ========== Garlic French Dressing: Drop 1 peeled, bruised clove of garlic into dressing and let stand 2-3 days at room temperature. Remove garlic before using dressing. Sweet French Dressing: Prepare as directed. Then mix in 1/4 c each of orange juice and honey or super fine sugar. Use to dress fruit salads. Hints: ===== For a creamier dressing, beat over ice for 1 to 2 minutes.",
    "isFavorite": false
  },
  {
    "date": "2023-12-04T01:53:14.311186",
    "id": 8,
    "calories": 20.5,
    "title": "Ella Julia's Rhubarb Dessert",
    "isCooked": false,
    "content": "Mix into a tight dough. Wet spoon and press dough into baking dish. Cover with 3 cups cut up rhubarb. Now sprinkle over it all with 1 package of pink gelatin (dry). Then mix together: 1 cup sugar 1/2 cup butter 1/2 cup flour Mix together and pour over gelatin. Bake for 45 minutes at 350 degrees F.. Serve warm or with whipped cream. mmmmm",
    "isFavorite": false
  },
  {
    "date": "2023-12-04T01:53:38.394329",
    "id": 9,
    "calories": 137.8,
    "title": "Electronic Gourmet's French Onion Soup",
    "isCooked": false,
    "content": "1) Cook the onions slowly with the butter and oil in a covered saucepan for 15 minutes. 2) Uncover, raise the heat to moderate and stir in the salt and sugar. Cook for 30 to 40 minutes stirring frequently until the onions have turned and even, deep golden brown. 3) Sprinkle in the flour and stir 3 minutes. 4) Off heat, blend in the boiling liquid. Note that instead of brown stock you may use canned beef bouillon (same quantity). Or, and equal part of boiling water plus stock or bouillon. 5) Add the wine and season to taste. Simmer partially covered for 30 to 40 minutes or more, skimming occasionally. Correct Seasoning. 6) Set aside uncovered until ready to serve, then reheat to simmer. 7) Just before serving, stir in the cognac. Pour into french onion soup bowls over the rounds of bread. Cover with cheese. Bake at 350 F until cheese melts.",
    "isFavorite": false
  },
  {
    "date": "2023-12-04T01:53:38.822656",
    "id": 9,
    "calories": 169.4,
    "title": "Electronic Gourmet's Garlic Soup",
    "isCooked": false,
    "content": "1) Put the oil and garlic into a very heavy large pot. Saute until almost golden brown in colour. Add the water, salt, monosodium glutamate and stock. 2) Simmer for 3 hours. Check the seasoning. 3) To serve: Place a slice of bread in each soup bowl. Put a ladle of the hot soup in the bowl and immediately, on top of the bread, break an egg. The egg will congeal and the bread will go to the bottom of the bowl. Note: Can be made a day ahead and refrigerated. To serve, follow step 3.",
    "isFavorite": false
  },
  {
    "date": "2023-12-04T01:53:39.216222",
    "id": 9,
    "calories": 79.7,
    "title": "Elegant Mushroom Soup",
    "isCooked": false,
    "content": "* NOTE: Use 1 1/2 pounds or MORE of ripe mushrooms. The darker mushroom (older) adds a stronger flavor to the soup, that's what I usually use. I've made this with the regular white, as well as portabello mushrooms - a blend tastes fine, but the portobello tends to overpower slightly. 1. Melt butter in pot. Add sliced mushrooms, and saute gently until liquid is completely cooked out. Do not brown mushrooms. 2. Add at least 2 quarts chicken broth (reserve 1/3 cup), thyme, and bouillon. Bring to a full boil, and simmer, uncovered, until broth is reduced by 75%. Taste should be extremely strong (it will be diluted with the cream). Note: The reduction can take quite a while. 3. Mix cornstarch with reserved broth, and add to soup. Allow mixture to get very thick. 4. Gently add 2 quarts (or more) heavy cream. Blend, and bring to a gentle simmer. Taste, and adjust seasoning if needed. Thin with milk or cream if flavor is too strong, or soup is too thick. : Jocie Moravec",
    "isFavorite": false
  },
  {
    "date": "2023-12-04T01:53:39.579101",
    "id": 9,
    "calories": 289.4,
    "title": "Emeril's Onion Soup",
    "isCooked": false,
    "content": "Preheat the oven to 400 degrees F. In a large saucepan, over medium-heat, melt the butter. Add the onions. Season with salt and pepper. Sauté the onions until slightly caramelized, about 8 to 10 minutes. Add the garlic, sherry, Worcestershire sauce and stock. Season with salt and pepper. Bring the liquid to a boil and reduce to a simmer. Cook the soup for 15 minutes. Ladle the soup into oven-proof deep bowls. Spread the each piece of bread with 1/4 cup of the rillette. Float the croutons on top of the soup. Cover each crouton with a piece of cheese. Sprinkle the cheese with parsley. Place the bowls on a sheet pan and place in the oven. Bake until the cheese is bubbly and golden, about 6 to 8 minutes. Remove from the oven and serve. Yield: 8 servings",
    "isFavorite": false
  },
  {
    "date": "2023-12-04T01:53:39.912136",
    "id": 9,
    "calories": 32.3,
    "title": "End-Of-Month Vegetable Soup",
    "isCooked": false,
    "content": "Make the bouquet garni by tying the herbs up in a cheesecloth or coffee filter. Put a quart of water to boil with about 1/2 t salt (I don't like to use too much salt if I use bouillon), the bouquet garni and the bouillon. Dice the onion, mince the garlic, and add these to the soup together with the bacon and/or prosciutto ends. Bring this to a boil. Simmer 5 minutes. If scum forms on the surface, skim it off. Dice the potatoes and add to the boiling pot. Cut up everything else and add it. Add the wine. Adjust the liquid so that it covers the vegetables. After it boils again, adjust the seasoning and simmer for about an hour, or until it is done (this is quite subjective). NOTES: * Soup with a mixture of vegetables -- I had an eclectic mixture of vegetables going bad in the refrigerator, so I collected them and came up with this soup. It was very good, so I would like to share it with you all. Caveat: I rarely measure anything, so be careful of quantities. * This will serve 6 people at once, or 2 people for three days. It ages well in the refrigerator. : Difficulty: easy. : Time: 10 minutes preparation, 1 hour simmering. : Precision: no need to measure.",
    "isFavorite": false
  },
  {
    "date": "2023-12-04T01:53:40.264926",
    "id": 9,
    "calories": 44.8,
    "title": "Engadiner Gerstensuppe / Engadine Barley Soup",
    "isCooked": false,
    "content": "Bring ham, beef, barley and beans to boil in about 30 fl oz water, and allow to simmer for about 2 hours. Add shredded cabbage and potatoes (other vegetables such as carrots and celery can be added if desired). After a further hour's cooking, thicken soup with cream previously blended with the flour, bring to the boil once more, and serve. From TANTE HEIDI'S SWISS KITCHEN, Eva Marie Borer / shared by Diane Duane",
    "isFavorite": false
  },
  {
    "date": "2023-12-04T01:53:40.601731",
    "id": 9,
    "calories": 62.1,
    "title": "English Pea Soup",
    "isCooked": false,
    "content": "Comine English peas, lettuce, spinach, green onions, bouillion granules, chervil and pepper in a large saucepan; stir in water. Cover and bring to a boil; reduce heat, and simmer 20 minutes. Process mixture to saucepan, and stir in milk. Cook over medium heat, stirring frequently, until thoroughly heated. Food Exchange per serving: 1/2 STARCH EXCHANGE; CAL: 46; CHO: tr; CAR: 8gm; SOD: 64mg:",
    "isFavorite": false
  },
  {
    "date": "2023-12-04T01:53:40.998156",
    "id": 9,
    "calories": 97.7,
    "title": "Fresh Green Chile Soup with Tumbleweed Greens",
    "isCooked": false,
    "content": "Roast the chiles and peppers by the Open-Flame Method. Peel the chiles and peppers, pull off the stems, remove the seeds and veins, and set aside. In a medium saucepan, parboil the potatoes in boiling water with 1 teaspoon of the salt until tender. Puree the green chiles and then the red peppers separately in a food processor until smooth. Mix the purees together, add the potatoes and stock, and process in 2-cup batches for another minute, or until smooth. Add the remaining salt, the pepper, and garlic and process again. Press the puree through a fine sieve. Heat the puree in a saucepan. Serve hot, garnished with tumbleweed greens.",
    "isFavorite": false
  },
  {
    "date": "2023-12-04T01:53:41.368389",
    "id": 9,
    "calories": 197.29999999999998,
    "title": "Fresh Herb Summer Soup",
    "isCooked": false,
    "content": "Pour chicken broth into a large saucepan. Add the fresh herbs. Bring to a boil, lower heat, and simmer for 20 minutes. In a separate bowl, beat the egg yolks lightly with the cream. Slowly whisk 1 cup of the hot broth mixture into the cream-yolk mixture. Pour this mixture into the pan in a stream, whisking constantly. Cook for 6 to 8 minutes or until thickened. Do not boil. Cool completely. Chill, covered, for at least 3 hours, better if chilled overnight. Seasan with white pepper. Garnish with minced fresh herbs. Yield: 8 to 10 servings. BEN HUSSMAN (MRS. WALTER, JR.)",
    "isFavorite": false
  },
  {
    "date": "2023-12-04T01:53:41.747515",
    "id": 9,
    "calories": 52.1,
    "title": "Fresh Minestrone Soup",
    "isCooked": false,
    "content": "In 2 quart microwave safe casserole, combine all ingredients except cheese. Cover; microwave at high 11-13 minutes, stirring once, or until pasta is tender. Serve in bowls sprinkled with cheese, if desired.",
    "isFavorite": false
  },
  {
    "date": "2023-12-04T01:58:52.747497",
    "id": 10,
    "calories": 277.9,
    "title": "Elegant Apple Dumpling",
    "isCooked": false,
    "content": "Mix flour, cinnamon, salt, butter and shortening until a crumbly mixture forms. Add in the juice slowly, until a smooth dough forms. Melt butter, and mix the rest of the ingredients into it. Putting it all together: Core 3/4 of an apple (preferably a Granny Smith) making sure that there is plenty of room for the filling. Roll out the dough, the thinner the better. Wrap dough around the apple. Squeeze off the excess and create leaves for the top of the apple with the extra. Bake at 350 degrees for approximately 20 minutes until dough becomes a light to golden brown. It will not get too dark so definitely keep checking on it. The dough recipe should yield enough for two apples. To make a stem for the apple use a small piece of cinnamon stick :",
    "isFavorite": false
  },
  {
    "date": "2023-12-04T01:59:35.132127",
    "id": 11,
    "calories": 536.7,
    "title": "Elizabeth David's Gateau Au Chocolat Et Aux Amandes",
    "isCooked": false,
    "content": "Break the chocolate into small pieces; put them with the rum and coffee to melt in a cool oven. Stir the mixture well, put it with the butter, sugar and ground almonds in a saucepan and stir over a low fire for a few minutes until all the ingredients are blended smoothly together. Off the fire, stir in the well-beaten egg yolks, and then fold in the stiffly-whipped whites. Turn into a lightly-buttered shallow sponge-cake tin, of 7 to 8 inches diameter, or a tart tin with a removable base. Stand the tin on a baking sheet and cook in a very low oven, 290 deg. F., for about 45 minutes. This cake, owing to the total absence of flour, is rather fragile, so turn it out, when it is cool, with the utmost caution. It can either be served as it is, or covered with lightly whipped and sweetened cream. It is a cake which is equally good for dessert or for tea-time.",
    "isFavorite": false
  },
  {
    "date": "2023-12-04T02:01:27.578418",
    "id": 12,
    "calories": 341.1,
    "title": "Electronic Gourmet's Garlic and Herb Salad Dr",
    "isCooked": false,
    "content": "1) Shake all ingredients in a small jar with a tight fitting lid. Let stand at room temperature for at least 1 hour. The longer the better. 2) Shake again and use to dress any crisp green salad. Hint: ~---- Store in jar and refrigerate 4-5 days. Always shake before using.",
    "isFavorite": false
  },
  {
    "date": "2023-12-04T02:02:54.949729",
    "id": 13,
    "calories": 0,
    "title": "Orange Spice Coffee Cake (Ccc)",
    "isCooked": false,
    "content": "Preheat oven to 350F. In a large bowl, combine Bisquick, sugar, Sweet One and orange peel. With a pastry blender or two knives used scissor fashion, cut in margarine until mixture resembles coarse crumbs. Remove 1/2 cup and set aside. To remaining mixture add cinnamon, baking powder, baking soda and ginger. In another small bowl, whisk together buttermilk, egg substitute and orange juice. Add to crumb mixture in large bowl; mix until just combined. Spray a 9-inch round baking pan with non-stick cooking spray. Spread batter evenly into the pan. Sprinkle reserved crumbs on top of batter. Bake 35-40 minutes or until toothpick inserted in center comes out clean. Cool on rack for 15 minutes. Invert cake onto rack and cool completely. Per serving: 155 calories, 3g protein, 5g fat, 25g carbohydrate, 0mg cholesterol, 315mg sodium. \"Low-fat and cholesterol-free, enjoy a delicious slice at breakfast with tea, or for a mid-day coffee break.\"",
    "isFavorite": false
  },
  {
    "date": "2023-12-04T02:02:54.950885",
    "id": 13,
    "calories": 0,
    "title": "Spaghetti with Chopped Brocccoli",
    "isCooked": false,
    "content": "Heat oil in a medium skillet over low heat; stir in garlic. Saute, stirring, just until edges begin to turn golden, about 3 minutes. Add the broccoli; cover and cook over low heat until tender, about 5 minutes. Cook spaghetti til al dente. Toss with broccoli and garlic oil; sprinkle with pignoli and grated cheese before serving. Per serving: 480 Calories (kcal); 20g Total Fat; (37% calories from fat); 11g Protein; 64g Carbohydrate; 1mg Cholesterol; 29mg Sodium Food Exchanges: 4 1/2 Grain(Starch); 0 Lean Meat; 0 Vegetable; 0 Fruit; 3 1/2 Fat; 0 Other Carbohydrates",
    "isFavorite": false
  },
  {
    "date": "2023-12-04T02:02:59.944201",
    "id": 14,
    "calories": 0,
    "title": "Electronic Gourmet's Chili",
    "isCooked": false,
    "content": "1) Chop the steak into 1 inch cubes. Heat the oil and beef a few cubes at a time, turning to brown on all sides. Add the chopped onions and saute over medium heat for 2 or 3 minutes then add the garlic. 2) Season with salt to taste. Add the boiling water, caraway and sesame seeds and oregano. Reduce heat, cover and simmer for 1 hour. 3) Gradually stir in the chili powder, testing frequently until you achieve the degree of flavour and hotness that suits you. Add olives, cover and simmer for another hour. 4) Taste, and correct the seasoning then mix in kidney beans and heat through. Toasted french bread, tortillas or corn bread go well with this and a crisp green salad. Hints: ===== Beer is the only drink that can stand up to the spiciness of the chili. Cool and freeze in containers. Serving day heat over low heat.",
    "isFavorite": false
  },
  {
    "date": "2023-12-04T02:02:59.951479",
    "id": 14,
    "calories": 0,
    "title": "Electronic Gourmet's Garlic Bread",
    "isCooked": false,
    "content": "1) Blend garlic with butter and let stand at room temperature 1 hour. 2) About 1/2 hour before serving, preheat oven to 375 F. 3) Meanwhile, slice bread 1 inch thick, cutting to but not through the bottom and holding knife at a slight angle. 4) Spread both sides of each slice with garlic butter and wrap loaf snugly in heavy foil. Place on a baking sheet and warm 20-25 minutes. 5) Unwrap and serve in a long napkin wrapped bread basket, or break into chunks and serve in a round napkin wrapped basket. Variations: =========== Herbed Garlic Bread: Mix 1 ts minced parsely and 1/4 ts each of thyme and oregano or marjoram into garlic butter and proceed as above. Cheese Garlic Bread: Mix 1 tb grated parmesan, 1/4 ts salt, 1/8 ts pepper and 1/4 ts each of savory and oregano or thyme into garlic butter and proceed as above. Curry or Chili Garlic Bread: Mix 1 to 2 ts curry or chili powder into garlic butter and proceed as above. Hints: ====== You can freeze before baking. On serving day open foil and bake at 350 F for 15 minutes. You can also use a microwave.",
    "isFavorite": false
  },
  {
    "date": "2023-12-04T02:02:59.954315",
    "id": 14,
    "calories": 0,
    "title": "Electronic Gourmet's Herb Salad Dressing",
    "isCooked": false,
    "content": "1) Place oil, herbs, salt and pepper in a shaker bottle or large glass measuring cup. Let stand at room temperature for 3 to 4 hours. The longer the better. 2) Add vinegar and shake or stir well to blend.",
    "isFavorite": false
  },
  {
    "date": "2023-12-04T02:02:59.955632",
    "id": 14,
    "calories": 0,
    "title": "Electronic Gourmet's Marinated Steak",
    "isCooked": false,
    "content": "1) Combine red wine, onion, garlic and black pepper. Marinate steak in this mixture for at least 2 hours turning occasionally. Overnight in fridge is best. 2) Remove the steak, reserving the marinade and pat it dry. Rub the steak with butter. 3) Broil the steak over hot coals, or under broiler until medium rare (or to your liking). 4) Boil the marinade until reduced by two thirds. Discard the garlic clove and pour the sauce over the steak. Goes great with a bottle of dry red table wine from either California or the Rhone region of France.",
    "isFavorite": false
  },
  {
    "date": "2023-12-04T02:02:59.957059",
    "id": 14,
    "calories": 0,
    "title": "Electronic Gourmet's Steak Diane",
    "isCooked": false,
    "content": "1) Fry shallots in the hot butter for 2 minutes. Add the thin slices of steak, cook 1 minute on either side. 2) Lift out the meat, and put onto a hot dish. Add the sauce, and the brandy to the butter. 3) Ignite if wished (and insured) and pour over the steaks. Garnish with chopped parsley. This dish requires last minute cooking.",
    "isFavorite": false
  },
  {
    "date": "2023-12-04T02:06:23.613114",
    "id": 15,
    "calories": 0,
    "title": "Elixir of Portobello",
    "isCooked": false,
    "content": "To roast the onion, if you have a gas range, simply place the onion right on the burner, in a high flame, and roast, turning with tongs, until the outer skin is charred all the way around. If range is electric, you can roast in a preheated 500 oven. Plunge the onion into ice water to stop the cooking, then rub off the black skin under running water. Render the bacon in a 5 quart pot over high heat until crisp, about 8 minutes. Add 1 pound of the mushrooms, all the bell peppers, the celery and onions and cook, stirring occasionally, for about 5 minutes. Add the syrup, flour, and seasoning mix and stir until the flour is completely absorbed. Stir in the stock and scrape the pot bottom thoroughly. Bring to a boil, add the remaining mushrooms, reduce the heat to medium low and cook at a brisk simmer for 30 minutes. Remove from the heat and serve.",
    "isFavorite": false
  },
  {
    "date": "2023-12-04T02:06:23.620808",
    "id": 15,
    "calories": 0,
    "title": "Emeril's Bloody Mary Mix",
    "isCooked": false,
    "content": "In a blender, combine first four ingredients together. Blend until smooth. Season the mixture to taste with the Worcestershire Sauce, hot sauce, salt and pepper. Store the mixture in a non-reactive container. Refrigerate the mixture for a least 6 hours before serving. Yield: about 1 quart",
    "isFavorite": false
  },
  {
    "date": "2023-12-04T02:06:23.623926",
    "id": 15,
    "calories": 0,
    "title": "Emeril's Rustic Brown Roux",
    "isCooked": false,
    "content": "ESSENCE OF EMERIL SHOW#EE2315 In a large saute pan, add the oil. When the pan is smoking hot, carefully whisk in the flour and reduce the heat. Season with salt and pepper. Stir the mixture constantly for 30 minutes or dark brown in color with a nutty aroma. Remove from heat.",
    "isFavorite": false
  },
  {
    "date": "2023-12-04T02:06:23.626640",
    "id": 15,
    "calories": 0,
    "title": "Enchiladas South Texas Style",
    "isCooked": false,
    "content": "Melt shortening in heavy skillet. Add the ground meat and brown. Sprinkle meat with flour; mix in skillet. Add tomato sauce and 1 cup water. Mix 1/2 cup water with the chili powder to form a smooth paste; add to the meat mixture. Add salt to taste and garlic powder. Cook over medium heat, uncovered, until it is of gravy consistency. Cover and simmer over very low heat. Add more water if the chili gravy becomes too thick. Dip tortillas one at a time in the hot chili gravy with a wide metal spatula. The tortillas will become pliable almost immediately, which will make rolling the enchiladas easier. Soaking too long will cause the tortillas to fall apart. Place a good sprinkling of grated cheese and minced onion and about a tablespoon of the meat mixture to one side of the center of the tortilla. Roll tortilla tightly around the filling and place loose side down in a glass casserole baking dish. For best results place the enchilidas in a row with sides touching. When all enchiladas have been formed, pour the remaining hot chili gravy over all, and sprinkle generously with grated cheese, and top with chopped onion. Bake at 350 deg. F until the cheese is melted. Serve immediately. NOTES : Serve with canned refried beans, guacamole, picante sauce, tortilla chips, spanish rice, steamed tortillas and butter. For faster preparation, you can layer mixture in a casserole, starting with a little meat sauce in the bottom of the casserole, a layer of torn (in quarters) tortillas, another meat layer, sprinke of cheese and onions, and repeat layers, ending up with a layer of meat sauce topped with cheese and onion on top. Then bake until casserole is hot and cheese is melted.",
    "isFavorite": false
  },
  {
    "date": "2023-12-04T02:06:23.629398",
    "id": 15,
    "calories": 0,
    "title": "Enchiladas with Salsa Mexicana",
    "isCooked": false,
    "content": "1. Preheat oven to 350F. Prepare Salsa Mexicana (see recipe) or use a prepared salsa. 2. Lightly spray a 1 2-in. nonstick skillet with vegetable oil cooking spray. Add bell pepper and onion, and cook over medium heat, stirring until softened, about 5 minutes. Add mushrooms, potatoes, garlic and 1/4 cup water and cook, stirring occasionally, until all vegetables are softened, about 10 minutes. Remove the skillet from the heat and stir in spinach, cilantro and red pepper flakes until spinach is wilted. Add feta and stir to blend. 3. Lightly spray an 8-in. square baking pan with vegetable oil. Warm each tortilla in a dry skillet over medium heat, about 1 minute per side. Place 1/3 cup of vegetable mixture in the lower part of each tortilla and roll up. Carefully place enchiladas seam side down in the baking pan, brush lightly with some of the liquid from the salsa, cover with foil and bake for 20 minutes. 4. To serve, divide lettuce among 6 plates. Place enchiladas on top of the lettuce. Top with salsa and garnish with cilantro sprigs. Notes: A nicely spiced entree, these light enchiladas are filled with veggies instead of the typical beef, pork or chicken. A bit of feta cheese is in the wrap for tangy flavor and creaminess. >from Kitpath with a little help from mcbuster 2.0d",
    "isFavorite": false
  },
  {
    "date": "2023-12-04T02:06:23.631965",
    "id": 15,
    "calories": 0,
    "title": "Fresh Green and Wax Beans",
    "isCooked": false,
    "content": "1. Wash and cut beans into 1 1/2 inch pieces. 2. Place in a deep 2-quart, heat-resistant, non-metallic casserole with the water. 3. Heat, covered, in Microwave Oven 12 minutes or until tender. Stir occasionally during cooking. 4. Drain water and season to taste.",
    "isFavorite": false
  },
  {
    "date": "2023-12-04T02:06:23.634475",
    "id": 15,
    "calories": 0,
    "title": "Grandma Elaine's Ice Box Cake",
    "isCooked": false,
    "content": "Use a glass pyrex dish or brownie pan. Whip in a medium bowl all of the cream, when whipped add sugar and vanilla extract. Drain pinapple. Wash and slice strawberries. Peel and slice bananas. Layer in whipped cream, cookies, fruit, whipped cream, cookies, fruit until the dish is almost filled to the top (about 4 or 5 layers). Chill for a few hours and serve. NOTES : Recipe courtesy of Erica Miller and her Grandma Elaine",
    "isFavorite": false
  },
  {
    "date": "2023-12-04T02:06:23.637034",
    "id": 15,
    "calories": 0,
    "title": "Gravad Lax",
    "isCooked": false,
    "content": "Fillet and debone the salmon. Rinse, dry and lay fillets (flesh up) side-by-side on a sheet of foil. Roughly chop the dill; mix with the other ingredients and sprinkle over one of the fillets. Place the other fillet flesh down on top; fold over the foil and seal it tightly all the way around. Put into a dish and add a weight to the top; then place into a refrigerator for 48 hours. Turn the parcel after 12 hours and baste both sides with juices. Carve into thin slices as you would for smoked salmon. Arrange on each plate, accompanied with a dressing or green salad.",
    "isFavorite": false
  },
  {
    "date": "2023-12-04T02:06:23.639531",
    "id": 15,
    "calories": 0,
    "title": "Gravad Lax ( Tessa )",
    "isCooked": false,
    "content": "This is method of curing fresh fish, in this case salmon, which is very easy to do at home and which is gentler (and therefore often more acceptable to children) than the more usual smoked salmon. The cured dish is not at all salty and makes a simple and fresh starter. Skin and pin-bone the salmon, taking care that all visible bones are removed. Remove and discard any dark flesh under the skin. Wash and dry the fish. Mix together the salt, sugar, pepper and half the dill. Sprinkle half the cure mixture over the fish (patting it into the flesh), put the salmon into a shallow dish (china is good), turn and sprinkle the remainder. Cover the fish tightly with food wrap and keep refrigerated overnight, turning the fish and basting it with the juices at frequent intervals. The next day remove the salmon, rinse it and then pat dry with kitchen paper. Sprinkle the remaining dill over the top side of the dish, patting it in with your hands. To serve slice very thinly with a sharp knife from top to bottom giving small thin slices edged with bright green dill. Some spring onion and creme fraiche goes well with it. Per serving: 1 Calories (kcal); trace Total Fat; (18% calories from fat); trace Protein; trace Carbohydrate; 0mg Cholesterol; 2mg Sodium Food Exchanges: 0 Grain(Starch); 0 Lean Meat; 0 Vegetable; 0 Fruit; 0 Fat; 0 Other Carbohydrates",
    "isFavorite": false
  },
  {
    "date": "2023-12-04T02:06:28.799389",
    "id": 16,
    "calories": 0,
    "title": "Elegant and Easy Wild Rice",
    "isCooked": false,
    "content": "Combine first 7 ingredients. Add 1-1/2 cans mushroom soup and 1/2 shrimp. Place mixture in baking dish. Bake at 350 for 1-1/2 hours. Sauce: Brown mushrooms in small amount of butter. Add remaining 1-1/2 cans of mushroom soup and remaining 1/2 shrimp. Heat through. Serve crab and rice mixture with the hot mushroom sauce. Makes about 20 servings.",
    "isFavorite": false
  },
  {
    "date": "2023-12-04T02:15:06.935408",
    "id": 17,
    "calories": 0,
    "title": "Elegant Fondue Chocolate (Sweet)",
    "isCooked": false,
    "content": "From the Oster (blender) brochure \"Fun and Fancy Fondue Feasts\" Break Toblerone into triangular pieces and melt in cream in fondue pot, stirring frequently until chocolate is melted. Add liqueur and stir well. (For a thinner fondue, add 1 to 2 tablespoons of cream). Variation: Use two 3-oz. bars Toblerone milk chocolate and one 3-oz. bar Toblerone bittersweet chocolate for a semisweet chocolate fondue. Dippers: Assorted fruit pieces - firm bananas, tart apples, rasp- berries, strawberries, pears; cubes of cream cheese; cubes of angel or sponge cake; marshmallows. This is a fun party dessert...you will need fondue forks. I use a teflon lined small casserole for my fondue pot and keep it warm on a Salton Hot Tray. /DESSERTS",
    "isFavorite": false
  },
  {
    "date": "2023-12-04T02:15:06.939805",
    "id": 17,
    "calories": 0,
    "title": "Elegant Mushrooms with Noodles",
    "isCooked": false,
    "content": "Saute mushrooms in butter. Cook noodles; drain. Add mushrooms, cream, cheeses, salt and pepper. Toss and serve immediately. Garnish with minced fresh parsley. This is a nice alternative for potatoes or rice. MRS W.E. NELSON (LYNNE) ATLANTA, GA",
    "isFavorite": false
  },
  {
    "date": "2023-12-04T02:15:06.943813",
    "id": 17,
    "calories": 0,
    "title": "Elegant Strawberry Torte",
    "isCooked": false,
    "content": "Mix together first 4 ingredients, reserve 1 cup crumb mixture. Combine egg, milk and soda. Add to crumb mixture; stir well. Pour into 2 greased, paper-lined 9-inch layer pans. Sprinkle with reserved crumb mixture, then add nuts. Bake at 375 for 25-30 minutes. Place one layer, nut side up, on serving plate. Spread with half the whipped cream. Top with sliced strawberries. Stack second layer and top as above. MRS RALPH WALL (ANN) HOLLY GROVE, AR",
    "isFavorite": false
  },
  {
    "date": "2023-12-04T02:15:06.950616",
    "id": 17,
    "calories": 0,
    "title": "Elegant White Cake",
    "isCooked": false,
    "content": "Preheat oven to 375F. Grease and flour two 8\" round pans. Combine Basic Cake Mix and milk in a large bowl. Beat at medium speed 2 minutes. Scrape bowl and beaters. Add egg whites and vanilla. Beat 2 more minutes. Pour into prepared pans. Bake 20 to 25 minutes, till a toothpick inserted in center comes out clean. Cool in pans 10 minutes, then cool on wire racks. Frost as desired.",
    "isFavorite": false
  },
  {
    "date": "2023-12-04T02:15:06.953562",
    "id": 17,
    "calories": 0,
    "title": "Elegant Wine Jelly",
    "isCooked": false,
    "content": "Measure sugar and wine in the top of a double boiler. Mix well . Place over, but do not touch, rapidly boiling water. Stir 3-4 minutes until sugar is disolved. Remove from heat. Add fruit pectin and mix well. Skim off foam. Place a metal spoon in a hot, sterilized wine glass. This keeps wine glass from breaking. Quickly pour in hot jelly mixture into glass within 1/4 inch from top. Remove spoon,completely cover with melted parafin to seal. Repeat with 4-5 more glasses.",
    "isFavorite": false
  },
  {
    "date": "2023-12-04T02:15:06.956294",
    "id": 17,
    "calories": 0,
    "title": "Eliopulos Stew",
    "isCooked": false,
    "content": "1. In a large, flameproof casserole over medium heat, heat oil. Saute onions in oil over medium heat until soft, about 5 minutes. 2. Break up tomatoes into small pieces. Stir together tomatoes and their juice, wine, tomato paste, brown sugar, currants, bay leaves, cinnamon, cumin, and cloves; add to casserole. 3. Add beef and simmer, covered, about 2 hours, or until meat is fork-tender. Season to taste with salt and pepper, and adjust other seasonings to taste. If stew is too liquid, uncover pan the last 30 minutes of cooking so that excess liquid will evaporate. 4. To serve immediately: Preheat oven to 350 degrees F. Remove casserole from heat and scatter cheese and nuts over top. Bake at 350 degrees F until cheese melts (about 5 minutes). * Timesaver Tip: Stew can be made up to 2 days ahead. Cool to room temperature, cover, and refrigerate or freeze. If you plan to defrost and reheat it in microwave oven, prepare stew in microwave-safe casserole or individual serving dishes. Wrap in heavy-duty foil; seal with freezer tape. Label; freeze at 0 degrees F up to 3 months. To serve, remove foil and cover loosely with waxed paper. Microwave 15 to 20 minutes on Defrost setting. Reheat on 50% power until hot, 3 to 5 minutes. If you plan to defrost and reheat stew in the oven, prepare recipe in an ovenproof casserole or individual heat-and-serve dishes. Wrap in heavy-duty foil; seal with freezer tape. Label; freeze up to 3 months. Remove tape, but not foil. Place dish in cold oven. Turn oven to 375 degrees F and heat 30 to 60 minutes, until mixture is hot. : the California Culinary Academy",
    "isFavorite": false
  },
  {
    "date": "2023-12-04T02:15:06.959203",
    "id": 17,
    "calories": 0,
    "title": "Elk Tenderloin with Brandy Mustard Sauce",
    "isCooked": false,
    "content": "Remove silverskin from tenderloins and rub meat with split garlic cloves. Sprinkle lightly with thyme and black pepper. Wrap bacon around tenderloin and use toothpick to secure. Place in hot frypan and saute until bacon is cooked. Note: tenderloins should not be cooked past medium rare. Remove from pan and pour off excess grease. Place onion and bell pepper in pan for 30 seconds, add mushrooms and saute until tender. :",
    "isFavorite": false
  },
  {
    "date": "2023-12-04T02:15:06.960642",
    "id": 17,
    "calories": 0,
    "title": "Ella's Brunswick Stew",
    "isCooked": false,
    "content": "Pan fry ground beef until all red is gone. Cook the potatoes and onions in chicken broth until tender. add cooked bround beef. Add all other ingredients and simmer for about 30 minites or slow cook for 3 hours. Can be frozen. NOTES : May use 1 pound pork butt steak, boiled and chopped, instead of ground beef.",
    "isFavorite": false
  }
]